{
  "You have configured a Session Initiation Protocol (SIP) trunk to a remote Cisco Unified Communications Manager (CUCM) server. You have verified the correct IP address was used and you have applied the Standard SIP Profile and Non Secure SIP Trunk Security Profile.  You have also verified the correct settings were used on the remote server's SIP trunk. Despite this, all calls that attempt to use this trunk fail, and no trace files are generated. What should you do to resolve this issue?  ": "Reset the SIP trunks on both CUCM servers.",
  "When configuring Cisco Unified Communications Manager (CUCM), which configuration enables phones to automatically register to a Cisco Unified Communications publisher when the connection to the subscriber is lost?": "Unified CM Group",
  "With Cisco Realtime Monitoring Tool, you can review SDL traces in which of the following ways?": "Remote Browse or Download",
  "What are three valid types of users in Unity Connection? ": "Local, LDAP, AXL",
  "You have a user reporting that their unicast music on hold audio is a \"beep\" instead of the configured music source. What is likely the problem?": "A music on-hold source has not been selected.",
  "If you have Cisco Unified Communications Manager server with an IP address of 10.1.5.15, which web address would you have to use to access the Dialed Number Analyzer (DNA) tool?": "https://10.1.5.15/dna",
  "Which call-signaling protocols are supported with VoIP dial peers?": "SIP, H.323, and MGCP",
  "If you were asked to capture diagnostic logs from Unified Communications Manager (UCM) using the Real-Time Monitoring Tool (RTMT), which feature would you use?": "Trace and Log Central",
  "Which Dynamic Host Control Protocol (DHCP) option is used to provide the IP address of the Trivial File Transfer Protocol (TFTP) server that endpoints use to obtain their configuration files and software?   ": "Option 150",
  "Which call distribution algorithm will ring all identified devices at once?": "Broadcast",
  "Your users have reported that URI lookups are having problems when dealing with URIs with particular case properties. You analyze the enterprise parameter for URI Lookup Policy and see that it is configured as Case Sensitive. What does this tell you about the lookup behavior?": "It will match the exact case-sensitive URI configured in Unified Communications Manager.",
  "The following problem has been reported: A user logs out of extension mobility. Upon logging out, the phone reverts to the default device profile, and the user can no longer access phone services. What is the most likely cause?": "The enterprise parameter for Synchronization between Auto Device Profile and Phone Configuration is set to False.",
  "You have been tasked with deploying multicast music-on-hold within your enterprise, a network consisting of multiple routed IP subnets. What would be your first step?": "Ensure you have multicast routing enabled throughout your network.",
  "Which URL path on the Unified Communications Manager server is used to access Cisco Unified Reporting?": "/cucreports",
  "You open a Session Initiation Protocol (SIP) trace with Translator X in order to troubleshoot a SIP call. You see an INVITE message for your call, followed by a few other messages, and finally a 404 message. What can you infer about the SIP call you are looking at?": "The call could not be completed due to an unknown destination.",
  "What describes a broadcast distribution type for a line group?": " Devices ring simultaneously",
  "What is a shared line appearance?": "A single directory number in a single partition provisioned on multiple endpoints",
  "Which statement about the call routing process using partitions and calling search spaces (CSS) is true? ": "A device has access only to numbers in partitions listed in the CSS of the calling device.",
  "As a Cisco Collaboration administrator, you need to verify that the Cisco TFTP service hasbeen activated, that this service is running, and for how long. How would you get this information from a single webpage?   ": "Navigate to Cisco Unified Serviceability, select Tools, and click on the Control Center - Feature Services.  ",
  "Some users report that they cannot dial out from headquarters on their Cisco IP Phones to public switched telephone network (PSTN) users, but others can. Which troubleshooting approach would you take to most directly isolate the source of the failure of the users who cannot dial out to the PSTN?": "Use Dialed Number Analyzer (DNA) to analyze the dialing permissions of the Cisco IP phones.",
  "You would like to quickly evaluate database replication status for Unified Communications Manager. Which report in Cisco Unified Reporting would be the most appropriate to run?": "Unified CM Database Status",
  "Which service would an administrator choose if they need to modify calling parameters?": "Cisco CallManager ",
  "What is a mandatory requirement when creating a Session Initiation Protocol (SIP) trunk? ": "SIP profile",
  "You have created a Date-Time Group for phones located in New York. How do you associate this group to the phones? ": "Associate the Date-Time Group with the Device Pool used by the phones.",
  "Which Cisco Unified Communications Manager Services must be activated to enable Cisco Unified CM Bulk Administration Tool (BAT)?": "Cisco Bulk Provisioning Service",
  "What is a good use case for Survivable Remote Site Telephony (SRST)?": "Deploying an SRST router at a remote location to provide local dialing in the event of a wide area network (WAN) failure.",
    "You have created a new custom role that is associated with the Cisco Call Manager Administration application. You have selected Update to give end users permission to make changes to endpoints and directory numbers. You put this role and end users into a group.  Users complain that they cannot sign into the Cisco Unified CM Administration page. What needs to be done so that end users can sign in?": "You need to also assign the Standard CCMADMIN Administration role to the group.",
    "When configuring Native Call Queuing on a hunt group in Unified Communications Manager, which configuration parameters are mandatory?": "Hunt pilot, hunt list, maximum number of callers allowed in queue, maximum wait time in queue",
    "You have a user reporting that their unicast music on hold audio is a \"beep\" instead of the configured music source. What is likely the problem?": "A music on-hold source has not been selected.",
    "What are three valid types of users in Unity Connection? ": "Local, LDAP, AXL",
    "Which call-signaling protocols are supported with VoIP dial peers?": "SIP, H.323, and MGCP",
    "Which call distribution algorithm will ring all identified devices at once?": "Broadcast",
    "Some users report that they cannot dial out from headquarters on their Cisco IP Phones to public switched telephone network (PSTN) users, but others can. Which troubleshooting approach would you take to most directly isolate the source of the failure of the users who cannot dial out to the PSTN?": "Use Dialed Number Analyzer (DNA) to analyze the dialing permissions of the Cisco IP phones.",
    "Which Dynamic Host Control Protocol (DHCP) option is used to provide the IP address of the Trivial File Transfer Protocol (TFTP) server that endpoints use to obtain their configuration files and software?   ": "Option 150",
    "What is a good use case for Survivable Remote Site Telephony (SRST)?": "Deploying an SRST router at a remote location to provide local dialing in the event of a wide area network (WAN) failure.",
    "Your users have reported that URI lookups are having problems when dealing with URIs with particular case properties. You analyze the enterprise parameter for URI Lookup Policy and see that it is configured as Case Sensitive. What does this tell you about the lookup behavior?": "It will match the exact case-sensitive URI configured in Unified Communications Manager.",
    "If you were asked to capture diagnostic logs from Unified Communications Manager (UCM) using the Real-Time Monitoring Tool (RTMT), which feature would you use?": "Trace and Log Central",
    "The following problem has been reported: A user logs out of extension mobility. Upon logging out, the phone reverts to the default device profile, and the user can no longer access phone services. What is the most likely cause?": "The enterprise parameter for Synchronization between Auto Device Profile and Phone Configuration is set to False.",
    "Which service would an administrator choose if they need to modify calling parameters?": "Cisco CallManager ",
    "As a Cisco Collaboration administrator, you need to verify that the Cisco TFTP service hasbeen activated, that this service is running, and for how long. How would you get this information from a single webpage?   ": "Navigate to Cisco Unified Serviceability, select Tools, and click on the Control Center - Feature Services.  ",
    "You have been tasked with deploying multicast music-on-hold within your enterprise, a network consisting of multiple routed IP subnets. What would be your first step?": "Ensure you have multicast routing enabled throughout your network.",
    "What is a shared line appearance?": "A single directory number in a single partition provisioned on multiple endpoints",
    "With Cisco Realtime Monitoring Tool, you can review SDL traces in which of the following ways?": "Remote Browse or Download",
    "Which URL path on the Unified Communications Manager server is used to access Cisco Unified Reporting?": "/cucreports",
    "If you have Cisco Unified Communications Manager server with an IP address of 10.1.5.15, which web address would you have to use to access the Dialed Number Analyzer (DNA) tool?": "https://10.1.5.15/dna",
    "You are configuring a call routing destination on a Communications Manager Express (CME) to point to a remote SIP device. Which configuration would you deploy?": "Router(config)#dial-peer voice 100 voip\nRouter(config-dial-peer)#destination-pattern 4195551234\nRouter(config-dial-peer)#session protocol sipv2\nRouter(config-dial-peer)#session target ipv4:10.70.21.10",
    "What describes a broadcast distribution type for a line group?": " Devices ring simultaneously",
    "You are required to stop Cisco Unified Communications Manager (CUCM) from advertising the OPUS codec for recording enabled devices. You have tried to configure the region to use G.711 (64kb), however this has failed to prevent OPUS from being used. What should you do to accomplish the objective? ": "In CUCM Service Parameters set Opus Codec Enabled to Enabled for all Devices Except Recording-Enabled Devices.",
    "You recently upgraded a Cisco Webex DX80 through its web interface, but discovered the next morning that the unit has reverted back to its previous version. What should you do to prevent this from happening again? ": "Confirm the phone load name in the phone configuration.",
    "You would like to quickly evaluate database replication status for Unified Communications Manager. Which report in Cisco Unified Reporting would be the most appropriate to run?": "Unified CM Database Status",
    "What is a mandatory requirement when creating a Session Initiation Protocol (SIP) trunk? ": "SIP profile",
    "When configuring Cisco Unified Communications Manager (CUCM), which configuration enables phones to automatically register to a Cisco Unified Communications publisher when the connection to the subscriber is lost?": "Unified CM Group",
    "Which Cisco Unified Communications Manager Services must be activated to enable Cisco Unified CM Bulk Administration Tool (BAT)?": "Cisco Bulk Provisioning Service",
    "When are IOS transcoders needed?": "When you need to convert audio from one codec type to another",
    "When creating a local user in Unity Connection, which three parameters are mandatory?": "Alias, Extension, and Based-on Template",
    "In general, how do you configure a Cisco Unified Border Element (CUBE) to support Uniform Resource Identifier (URI) dialing?": "Create dial-peers with URI destinations.",
    "You have created a custom credential policy for your internal users to mandates them to have a ten digit or longer password. You want to apply this policy to existing users and have it take effect immediately. How would you do this?": "Go to the end user account, select Edit Credential, and associate the new policy. ",
    "When troubleshooting layer 3 issues on an ISDN PRI, which signaling protocol is of most interest?": "Q.931",
    "You have placed all directory numbers (DNs) in the Phones partition. During testing, you discover that you cannot place calls between IP phones, but you can place calls to the public switched telephone network (PSTN) and voicemail. What is a possible cause of this issue?": "The IP phones have not been assigned a CSS.",
    "You have configured a Session Initiation Protocol (SIP) trunk to a remote Cisco Unified Communications Manager (CUCM) server. You have verified the correct IP address was used and you have applied the Standard SIP Profile and Non Secure SIP Trunk Security Profile.  You have also verified the correct settings were used on the remote server's SIP trunk. Despite this, all calls that attempt to use this trunk fail, and no trace files are generated. What should you do to resolve this issue?  ": "Reset the SIP trunks on both CUCM servers.",
    "Which URL path on the Cisco Unity Connection server is used to access \"Web Inbox\"?": "./inbox",
    "What is the intended use case for Extension Mobility?": "Allowing multiple users to share (or \"hotel\") a physical phone; inheriting their line appearances, services, and speed dials, regardless of which physical phone they use",
    "Which hunt group feature (softkey) would be appropriate to display in the On Hook, Off Hook, and Connected states?": "HLog",
    "If you want to force the Unity Connection subscriber node to start taking all calls, what action should you take?": "Click Stop Taking Calls in Unity Connection Serviceability on the publisher.",
    "You are trying to configure Cisco Unified Communications Manager (CUCM) to be able to control and manage the configuration of a Media Gateway Control Protocol (MGCP) gateway. You have configured the server and you have configured the router, however the gateway registration has failed. Which additional action is required? ": "Apply the ccm-manager configuration command to the gateway.  ",
    "Users have complained that their long distance calls to the public switched telephone network (PSTN) are not working. You have configured a new long distance route pattern and need to modify the source numbers by adding the 505 area code to outbound calls. How would you accomplish this?": "Configure and assign a calling party transformation mask of 505XXXXXXX.",
    "Which dial-peer shown below will correctly route a call using the Session Initiation Protocol (SIP)?": "Device(config)# dial-peer voice 123 voip\nDevice(config-dial-peer)# session protocol sipv2\nDevice(config-dial-peer)# destination-pattern 5550179\nDevice(config-dial-peer)# session server-group 171",
    "What is a valid distribution algorithm for a local route group?": "Circular",
    "A user is trying to call a mobile phone using the number 95558341, where 9 is the prefix to call off-net numbers. Calls to mobile phones have worked in the past, but now the call does not work. What should you start with to resolve the issue?": "Verify the route pattern, route list, and route group.",
    "Which Cisco Unified Communications Manager (CUCM) menu enables you to start and stop services on individual servers in a cluster?": "Cisco Unified Serviceability",
    "Which are valid Call Pickup group types?": "Call Pickup, Group Pickup, Directed Call Pickup, Other Pickup",
    "What is the maximum number of Cisco Unified Communications Manager (CUCM) servers, per cluster, that can have the Call Manager service activated?": "8",
    "You are trying to configure a Session Initiation Protocol (SIP) trunk to the 10.2.5.15 IP address, however you receive an error when you click save. How can you resolve this issue? ": "Apply a SIP profile to the SIP trunk.",
    "What is the purpose of configuring the Network Time Protocol (NTP) server IP address in the Cisco Unified Operating System Administration page on the Publisher server? ": "This will be the NTP server that all CUCM servers will sync their time with."
  }