{
  "What is the correct syntax to navigate to this route: { path:'hero/:id', component:HeroDetailComponent }?": "this.router.navigate(['/hero', hero.id]);",
  "What is the purpose of the InjectionToken class?": "To allow a service that isn't a class to be registered with the dependency injection system",
  "Given the following constructor for a component:constructor(private myService: MyService)Which block of code is equivalent for the purposes of dependency injection?": "constructor(@Inject(MyService) private myService)",
  "What action must you take to create the form model (ngForm) to facilitate validation and error-handling when building template-driven forms?": "Define the form HTML element to create the form model (ngForm) automatically.",
  "You perform integration testing. You first test the modules individually and then integrate and test them at the same time. Which type of integration testing are you performing?": "Big bang integration testing",
  "How many Angular modules must be defined for an Angular application?": "Zero",
  "What is the key difference between template-driven and reactive forms?": "A template-driven form is asynchronous in nature; a reactive form is mostly synchronous",
  "You have an Angular application that restricts access to the user area with a password. This area's home component is protected using the CanActivate route guard, but it has child routes. How do you protect these child routes?": "The home components route guard will protect the child routes.",
  "In async testing, how can you wrap a test function in an asynchronous test zone?": "By using waitForAsync()",
  "What command will create a new Angular application with a root routing module?": "ng new my-dream-app and choose the option to configure routing from the interactive prompt",
  "What is the ideal outcome of using shallow tests?": "To render a template without child component dependencies.",
  "How does a template reference variable in the following code (#heroNameVar), help with validation of a template-driven form?<input id=\"heroNameId\"       type=\"text\"       required       [(ngModel)] = hero.name       name=\"heroName\"       #heroNameVar=\"ngModel\" />": "It provides a reference to an input element's state that you can use for styling errors or displaying validation error messages.",
  "What is the difference in how reactive forms and template-driven forms validate the information a user enters?": "Reactive forms use functions, while template-driven forms use directives.",
  "How could you define the appropriate routerLink syntax to specify a required query parameter?": "[routerLink]=\"['/heroes']\" [queryParams]=\"{id: hero.id}\"",
  "You are building an application with Angular and want to use an external library in your project. What Angular command-line interface (CLI) command should you use to include an external library?": "ng add",
  "Which route guard would you use to prevent a user from navigating to another view before saving their content?": "CanDeactivate",
  "Based on the router's current state, what does Angular use to fill data dynamically?": "router-outlet",
  "How would you spy on any element?": "Implement two hooks, SpyDirective ngOnInit() and ngOnDestroy().",
  "Given the following template:<input type=\"text\"><button (click)=\"saveName()\">Save</button>Which block of code will correctly send the value entered into the input box into the saveName function?": "<input #name type=\"text\">\n<button (click)=\"saveName(name.value)\">Save</button>",
  "Which Reactive Extensions for JavaScript (RxJs) operator merges the output of many observations and reduces it to one observable?": "merge()",
  "What do the routerLinkActive and routerLinkActiveOptions in this code do?<li routerLinkActive=\"active\" [routerLinkActiveOptions]=\"{ exact: true }\">     <a [routerLink]=\"['/heroes']\">Hero List</a></li>": "When the heroes route is activated, it styles the li element using the defined style (\"active\"), but only when there is an exact match to the route.",
  "You work at a company as an Angular programmer. You must create snippets of code designed for error handling. What is the outcome of the following code?1. import { ErrorHandler, Injectable } from '@angular/core';2. @Injectable()3. export class Handlingerror implements ErrorHandler {4.     handleError(error) {5.        console.error('An error occured here: ', error.message);6.        console.error();7.        alert(error);8.    }9.   }": "One error message in the console and one in an alert dialog box",
  "You have a component that has two router outlets. Why do you need the name attribute on the second router outlet?": "To indicate it is not the primary outlet",
  "While creating an application using React and Angular, you must use react and react-dom in the application. How would you implement both?": "npm install -S react-in-angular react react-dom",
  "Angular uses zone.js to monkey patch each asynchronous event, so whenever any event occurs Angular runs change detection over its component tree, which leads to low performance. How can you fix this?": "Use the OnPush change detection strategy, which disables change detection from running on a component and its children.",
  "How can you simulate a server and return mock data with the HTTP requests in Angular?": "By using json Server",
  "What is the difference between the canLoad and canActivate methods in Angular?": "canLoad prevents the app from loading the entire module lazily if the user is unauthorized.\ncanActivate prevents unauthorized users from accessing certain routes.",
  "An application experiences vulnerabilities and slows down if it has to display a large file. How can you fix this?": "Using Component Development Kit (CDK) virtual scrolling",
  "Which set of component lifecycle hooks are valid and listed in the same sequence they fire?": "ngOnChanges, ngOnInit, ngAfterContentInit, ngAfterViewInit, ngOnDestroy",
  "How could you set an element's background color based on a property color of the component class?": "[style.background-color]=\"color\"",
    "Which statement is true about client certificates?": "They allow a client to authenticate with a Couchbase Cluster.",
    "You run the following command, but receive response code 401.curl -v -X POST -uhttp://10.143.192.102:8091/pools/default \\-d \"memoryQuota=256\" \\-d \"indexMemoryQuota=256\" \\-d \"ftsMemoryQuota=256\" \\-d \"cbasMemoryQuota=1048\" \\-d \"eventingMemoryQuota=512\"What could be the problem?": "The username and password were not specified.",
    "Which statement is true about a hard failover?": "It drops a node from a cluster reactively because the node has become unresponsive or unstable.",
    "Which statement is true about flushing a bucket?": "It deletes every object that a bucket contains.",
    "Which failover type has the ability to remove a data service node from the cluster in an orderly and controlled fashion, involving no downtime?": "Graceful failover",
    "How do you retrieve a specific log file from a Couchbase server?": "Perform GET on the sasl_logs endpoint and specify a log name.",
    "What tool is used to test cluster performance?": "cbworkloadgen",
    "What is the outcome of this operation?couchbase-cli bucket-flush -c 192.168.1.5:8091 --username Administrator \\ --password password --bucket travel-data": "Deletes every object in a bucket named travel-data",
    "Which statement is true about Couchbase backups?": "All backups are stored in and recovered from a backup repository.",
    "Which statement is true about a newly joined node in a cluster?": "It must be rebalanced into the cluster.",
    "You currently manage a Couchbase server running several nodes. You discover that one of those nodes was recently failed over.How can you fix it?": "Recover the node, then add it back to the cluster using a rebalance operation.",
    "What happens when a node is removed from a cluster?": "Resources are diminished and redistributed as node removal occurs.",
    "You successfully change the location of log files. What happens when you restart the Couchbase service?": "All subsequent logs will be created in a new directory.",
    "Which of the following is true about the tombstone purge interval of metadata?": "It removes the key and metadata for items that have been deleted or are expired.",
    "You receive an alert on your destination cluster with the following message:Remote or replica mutation received for bucket \"travel-sample\" on node \"10.198.245.109\" with timestamp more than 5000 milliseconds ahead of local clock. Please ensure that NTP is set up correctly on all nodes across the replication topology and clocks are synchronized.What could have resulted in this error?": "The physical clocks are drifting ahead and the drift is more than the threshold of 5 seconds.",
    "Which Couchbase CLI command is used to delete all objects within a bucket on a Couchbase server?": "bucket-flush",
    "What is a Couchbase cluster?": "A collection of one or more Couchbase server nodes",
    "How do you initialize a node with the REST API?": "Use the POST /nodes/self/controller/settings HTTP method.",
    "If you perform a statistical request via an XDCR REST API, what do you need to do to retrieve the number of checkpoints failed during a Cross Data Center Replication (XDCR)?": "End the endpoint URI with /num_failedckpts.",
    "What happens when you perform the following operation?couchbase-cli cluster-init -c 127.0.0.1 --cluster-username Administrator \\ --cluster-password password --services data --cluster-ramsize 1024": "It creates a Couchbase server cluster with the data service on the current node and a memory quota of 1024 MB.",
    "What operation allows a node to be removed from a cluster reactively?": "Hard failover",
    "What happens when a bucket is deleted? ": "All items are deleted and the bucket is removed. The bucket name can be reused.",
    "What is a protocol that provides security over a computer network?": "TLS",
    "How would you recover a node that has become unavailable in a Couchbase cluster? ": "Failover, remove, recover, then rebalance",
    "What is the default file log location on a Couchbase server hosted on Linux?": "/opt/couchbase/var/lib/couchbase/logs",
    "Why would you use Sync Gateway?": "To securely synchronize Couchbase data with mobile devices instead of using web services to access data on the server",
    "Why would you set a session timeout value for user sessions using the web console?": "To ensure that users are logged off after a period of inactivity",
    "What operation do you perform first to recover a node that has been failed over?": "Recovery operation",
    "Which statement is true about node-to-node encryption?": "It enables the encryption of network traffic between individual nodes of a cluster.",
    "What does it mean to provision a node?": "The node is configured and available for use.",
    "A node is removed from the Couchbase cluster. However, you notice some of the remaining nodes are performing significantly worse than others. How can the performance be improved on these nodes?": "Perform a rebalance operation.",
    "Which statement is true about auto-compaction settings?": "Auto-compaction is enabled by default for all Couchbase buckets.",
    "How do you ensure that data is transferred securely while using the cbrecovery tool?": "Include -s or --ssl in the command.",
    "Which statement is true about the cbworkloadgen tool?": "It generates random data and performs read/writes.",
    "What is the outcome of this operation?couchbase-cli bucket-flush -c 192.168.1.5:8091 --username Administrator \\ --password password --bucket travel-data": "Deletes every object in a bucket named travel-data",
    "You expect the following request to get information about a specific prepared statement in a query engine.curl -u Administrator:pword http://localhost:8093/admin/preparedsWhat is the issue with this request?": "You did not include the prepared statement in the URI.",
    "What is the process of re-distributing data and indexes among available nodes?": "Rebalancing",
    "Which statement is true about node availability for a Couchbase server?": "Full Administrators and Cluster Administrators can enable or disable auto-failover.",
    "What happens when you use a user account with insufficient permissions to execute the bucket-delete command?": "It fails with an unauthorized error.",
    "Which Couchbase CLI command completely deletes a bucket from a Couchbase server? ": "bucket-delete",
    "Which statement is true about cbtransfer?": "It can be used to move data directly between clusters residing on multiple operating systems without creating a backup file.",
    "Which tool provides insight into cluster performance in a Couchbase server?": "cbstats",
    "You need to configure alerts for several conditions on several Couchbase clusters. How do you configure this using the Couchbase CLI?": "Use the setting-alert command.",
    "A developer on your team is adding a new empty server group named Group 2. They use the following command, but are unsuccessful.couchbase-cli group-manage -c 10.143.190.101:8091 \\ -u Administrator \\ -p password \\ --group-name 'Group 2'What is the problem with the command?": "They did not specify the create parameter in the command.",
    "The following snippet manages cipher-suites with the CLI.couchbase-cli setting-security \\ -c 10.143.192.101:8091 \\ -u Administrator \\ -p password \\ --set \\ --tls-honor-cipher-order false \\ --cipher-suites TLS_RSA_WITH_AES_128_CBC_SHA,TLS_RSA_WITH_AES_256_CBC_SHAWhat is a possible error in this command?": "You specified an invalid value for the tls-honor-cipher-order flag.",
    "Which statement is true about cbcollect_info?": "It allows you to gather statistics from a specific node in a cluster.",
    "Why is monitoring an important feature of a Couchbase installation?": "Monitoring highlights potential issues before they happen and can alert users to take action.",
    "What is a Couchbase cluster?": "A collection of one or more Couchbase server nodes"
  }