{
    "A video embedded in a web page plays well and is compatible with the browser. Despite the good video quality, the loading process causes unwanted flickering. What action can you take to address this issue?": "Add width and height attributes in the video tag.",
    "You create a web page that shows two paragraphs and an image using the <p> and the <img> tags. You must provide a description of the tag that the paragraphs use and the image when a user hovers over them. How can you do so?": "Add the title attribute with the description in each element.",
    "When a <canvas> element exceeds the maximum screen size for the browser, what is the result?": "The canvas is rendered unusable and drawing commands do not work.",
    "Which block element groups the header elements of a table?": "<thead>",
    "You are using Notepad to create HTML files for your website. What is the benefit of using Notepad instead of a graphical text editor or an integrated development environment (IDE)?": "Light-weight software",
    "Which heading element do search engines look for first?": "<h1>",
    "The code given below shows the list of the games that can be played on a website whenever the user wishes.<select id=\"game\" name=\"game\" size=\"3\">  <option value=\"ludo\">Ludo</option>  <option value=\"chess\">Chess</option>  <option value=\"cards\">Cards</option>  <option value=\"has\">Hide & Seek</option></select>However, only three games are visible instead of all the games. How will you solve this problem?": "Replace size=3 to size=4.",
    "How many built-in heading tags are available in HTML5?": "Six",
    "You create a basic HTML web page with only one statement. You implement Cascading Style Sheets (CSS) to an element using three methods:myApp.html<html>    <head>    <link href=\"mystyle.css\" rel=\"stylesheet\">    <style>      span {        background-color: green;      }    </style>  </head>  <body>    <p>Hello, friends!      <span style=\"background-color: blue;\"> I give my best wishes to you all!      </span>    </p>  </body></html>myApp.cssspan { background-color: red;}What background color will you see for the phrase after rendering the script?": "Blue",
    "Which element specifies illustrations, diagrams, and photos?": "<figure>",
    "Which HTML element defines a list item?": "<li>",
    "Which integrated development environment would you use for developing an HTML website?": "Visual Studio",
    "You are creating a web page. You must place a header on it. Which header code is conventionally valid in HTML5?": "<section>  <header> ... </header></section>",
    "What HTML code can you use to structure a numbered list?": "<ol></ol>",
    "You are developing HTML files using a text editor (Notepad). You use Google Chrome to view them. Notepad lets you create files without any problem, but there are benefits you do not receive, such as an auto-complete feature, highlighted codes, and a live server to make changes to the web page automatically after you save the file. How can you get these features while building an HTML website?": "Use a graphical text editor such as Visual Studio Code.",
    "Which HTML sections correctly displays three headers in order of largest to smallest sizes?": "<h1>Apples</h1><h2>Oranges</h2><h3>Pears</h3>",
    "How can you change the size of a heading?": "font-size",
    "Which <video> element attribute allows you to set the video to play automatically when the page loads?": "autoplay",
    "Review the following markup:<!DOCTYPE html><html>  <head>    <title>      A Simple HTML Page    </title>  </head>  <body>      <div>          This is an important section of the page.      </div>  </body></html>Which HTML5 structural tag would you replace the <div> tag with to identify a significant portion of the content on the page?": "<section>",
    "What is the default unit of measurement for an element's width and height attributes?": "Pixels",
    "Why would you use service workers between web applications, the browser, and the network?": "To implement a proxy server between web applications, the browser, and the network",
    "You are building an HTML website for a club within your organization. The design team created a logo and submitted it as a GIF. You are using this logo as a favicon for the website. You write the following code:<head> <title> The Codegenix </title> <link rel=\"icon\" href=\"./logo.gif\"></head>You present the website content but the favicon is static. Why are you unable to present members with an animated favicon?": "You have not animated the icon using the JavaScript code.",
    "The following web page has multiple elements, including a list:<html>  <head>    <style>      .foo:hover {          background-color: green;      }    </style>  </head>  <body>    <p>You must retrieve these details from each employee and feed the data <a href=\"https://www.example.com/empDetails\">here</a>:</p>    <div class=\"foo\">      <ol style=\"background-color: beige;\">                <li>ID</li>          <li>Name</li>          <li>Unit</li>            </ol>    </div>    <p>Once done, notify me.</p>  </body></html>The list elements should have a beige background, but when a user hovers over them, the background must change to green. There is no change when hovering over the list elements, however. How can you fix the issue?": "<ol style=\"background-color: beige;\">      <div class=\"foo\">     <li>ID</li>     <li>Name</li>     <li>Unit</li>        </div></ol>",
    "You create an HTML web page that displays Yellow and Brown in separate lines. You copy the text Yellow and paste it into a text editor. What result do you get?<html>  <body>    <p>Yellow</p>    <p>Brown</p>    <script>      document.addEventListener('copy', function(p){          console.log(p);          p.clipboardData.setData('text/plain', 'Red');          p.preventDefault();       });    </script>  </body></html>": "Red",
    "You have a basic web page with the following HTML script:<html>  <body>    alert()  </body></html>What happens when you render the above script?": "You receive the text alert() on the web page.",
    "You are working an application that requires a synchronization action for the ServiceWorkerGlobalScope of a service worker. How can you achieve this?": "Implement the SyncEvent interface to depict the synchronization action.",
    "You download an HTML script with 50 lines of code from a GitHub repository and run it in Google Chrome. There are several mistakes on the web page. Which step should you perform first to debug the script?": "Open the script in a graphical code editor to fix it based on code color.",
    "You have four elements on a web page: a link, a paragraph, an image, and a GIF advertisement. You must make all four elements draggable. Which element would you add the draggable attribute to?": "The paragraph, the image, the link, and the GIF advertisement",
    "A video embedded in a web page plays well and is compatible with the browser. Despite the good video quality, the loading process causes unwanted flickering. What action can you take to address this issue?": "Add width and height attributes in the video tag.",
    "You highlight the text, \"custom placeholder\" and use Ctrl + X to cut. What happens?<head> <script>   function foo() {     document.getElementById(\"ps\").innerHTML = \"take this action\"   } </script></head><body>  <input type=\"text\" oncopy=\"foo()\" value=\"custom placeholder\"> <p id=\"ps\"></p></body>": "You cut the text with no pop-ups, warnings, or messages.",
    "You must create an HTML website with a paragraph and a list. You write the following script to achieve the task:<body>  <!-- A short list of HTML frameworks-->  <p main=\"track>You can include the following frameworks while building an HTML website --></p>  <ol>     <li>CSS</li>      <li>JavaScript</li>     <li>Bootstrap</li>  </ol></body>You receive the following rendered output on the web page:= 0 ? '&' : '?') + '_cacheOverride=' + (new Date().valueOf()); } parent.appendChild(elem); } } var protocol = window.location.protocol === 'http:' ? 'ws://' : 'wss://'; var address = protocol + window.location.host + window.location.pathname + '/ws'; var socket = new WebSocket(address); socket.onmessage = function (msg) { if (msg.data == 'reload') window.location.reload(); else if (msg.data == 'refreshcss') refreshCSS(); }; if (sessionStorage && !sessionStorage.getItem('IsThisFirstTime_Log_From_LiveServer')) { console.log('Live reload enabled.'); sessionStorage.setItem('IsThisFirstTime_Log_From_LiveServer', true); } })(); } else { console.error('Upgrade your browser. This Browser is NOT supported WebSocket for Live-Reloading.'); } // ]]>You run the script and receive an unexpected output on the web page. Why?": "There is a missing double quote on the invalid yet interpretable attribute main=\"track.",
    "You write code using the <canvas> tag in HTML. It displays a simple game that you made on your website.<canvas width=\"500\" height=\"500\" style=\"background-color:#562\"> <p>An error may have occurred or your browser does not support the canvas tag.</p></canvas><script> var blank = document.getElementById(\"canvas\"); var data = blank.getContext(\"2d\"); ...</script>Instead of the game, however, the paragraph written inside the <canvas> tag is displayed. Why?": "There is no id attribute in the <canvas> tag to connect it with its script.",
    "An HTML script has multiple elements::<!DOCTYPE HTML><html>  <body>    <!-- A short list of HTML frameworks. The comment ends here.    <p make=\"true\">You can include the following frameworks while building an HTML website --></p>    <ol>       <li>CSS</li>       <li>JavaScript</li>       <li>Bootstrap</li>    </ol>  </body></html>How many errors are present in the script?": "3",
    "Which element is specifically intended to isolate a piece of text that might be formatted in a different direction than text outside the element?": "<bdi>",
    "You must develop a JavaScript function to set a data value for an HTML element. The data includes the personal information about the user. The function outputs the current time along with all the data. Which JavaScript method should you use to assign the data value securely?": "element.textContent=data;",
    "Which HTML5 element replaces the use of the <applet> element?": "<object>",
    "Which element's positioning is independent of the main flow of an HTML5 document?": "<figure>",
    "You have two Cascading Style Sheets (CSS) scripts, foo.css and baz.css, in your src directory. You use the following code to include them in your HTML script:<html>  <head>    <meta charset=\"UTF-8\">    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">    <link href=\"src/*.css\" rel=\"stylesheet\">  </head>  <body>    <p> Hello, users! </p>  </body></html>You render the script, but no HTML elements use CSS styles. Why?": "You included both CSS scripts using a single link element.",
    "Which statement is correct about HTML5 debugging?": "An editor interprets an HTML script.",
    "Which attribute can specify that the input's value must match the format of the text entered into an <input> element?": "pattern",
    "What will be the output of the following markup?<ol> <li value=\"one\" /> <li value=\"two\" /> <li value=\"three\" /></ol>": "1.2.3.",
    "Consider the following HTML:<canvas width=\"300\" height=\"300\">An error occurs and the canvas is not rendered when the page is loaded. What is the problem?": "The <canvas> element requires the closing tag (</canvas>).",
    "When a <canvas> element exceeds the maximum screen size for the browser, what is the result?": "The canvas is rendered unusable and drawing commands do not work.",
    "You are making a website for school teachers to upload practice questions for their students. While writing an equation, you need symbols that indicate ^, _, and \\. What would you use to obtain these symbols with respective American Standard Code for Information Interchange (ASCII) digits 94, 95, and 92?": "&#94;, &#95;, &#92;",
    "You have a basic HTML script with one <p> tag:<html>  <head>    <style>      p {        background-color: blue;      }    </style>  </head>  <body>    <p>Hello, friends!</p>    </body></html>Which statement is correct based on the above script?": "\"Hello, friends!\" appears on the web page with a blue background. The HTML keeps the <style> tag within the <head> tag.",
    "What kind of list does the following code create?<dl> <dt></dt> <dd></dd></dl>": "Description list",
    "Which input type in HTML specifies what file types users can pick using an <input> dialog box?": "accept",
    "Which HTML5 element would you use to render the following formatted text with descriptions?TeaA hot beverageMilkA cold beverage": "<dl>  <dt>Tea</dt>    <dd>A hot beverage</dd>  <dt>Milk</dt>    <dd>A cold beverage</dd></dl>",
    "When would you use HTML inline frames (iframes)?": "When embedding a web page within another web page",
    "What is the syntax to display an American Standard Coder for Information Interchange (ASCII) character on an HTML web page using its ASCII number?": "&#number;"
  }